pub const PROMPT_MSG_HOME_TRAINING_WITH_ARGS: &str =
    "Зроби будь-ласка розклад тренувань, та які вправи побити, \
та з яким інвенторем,\
 у дома на кожний день тижня,\
 щоб тренування займало не більше півтори години у день,\
  і напиши тільки розклад, і в кіці нагадай що краще це узгодити з тренером, \
  якщо є, але також враховуй це: ";
pub const PROMPT_MSG_HOME_TRAINING_WITHOUT_ARGS: &str = "Зроби будь-ласка розклад тренувань \
та які вправи робити, та з яким інвенторем, \
у дома на кожний день тижня, \
щоб тренування займало не більше півтори години у день, \
і напиши тільки розклад, і в кіці нагадай що краще це узгодити з тренером, якщо є,";
pub const PROMPT_MSG_GYM_TRAINING_WITH_ARGS: &str =
    "Зроби будь-ласка розклад тренувань, та які вправи робити, \
та з яким інвенторем, у залі на кожний день тижня, \
щоб тренуванная займало не більше півтори години у день, \
і напиши тільки розклад, \
і в кіці нагадай що краще це узгодити з тренером, якщо є, але також враховуй це: ";
pub const PROMPT_MSG_GYM_TRAINING_WITHOUT_ARGS: &str =
    "Зроби будь-ласка розклад тренувань, які вправи робити, \
та з яким інвенторем, у залі на кожний день тижня, \
щоб тренуванная займало не більше півтори години у день, і напиши тільки розклад, \
і в кіці нагадай що краще це узгодити з тренером, якщо є,";
pub const PROMPT_MSG_DIET_WITH_ARGS: &str = "Зроби будь-ласка розклад дієти на кожний день тижня, \
    і напиши тільки розклад, і нагадай в кінці що краще це узгодити з тренером або дієтологом, \
    якщо є, але також враховуй це: ";
pub const PROMPT_MSG_DIET_WITHOUT_ARGS: &str =
    "Зроби будь-ласка розклад дієти на кожний день тижня, \
    і напиши тільки розклад, і нагадай в кінці що краще це узгодити \
    з тренером або дієтологом, якщо є";

pub const PROMPT_MSG_AGE: &str = "Врахуй що мені ";
pub const PROMPT_MSG_HEIGHT: &str = "Врахуй що мій зріст ";
pub const PROMPT_MSG_WEIGHT: &str = "Врахуй що моя вага ";

pub const OPEN_AI_MODEL: &str = "gpt-3.5-turbo";

pub const HOME_STATE: &str = "Home";

pub const GYM_STATE: &str = "Gym";
